In [3]:
import numpy as np
import pandas as  pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
pd1 = pd.Series([4, 8, 15, 16, 23, 42])

In [7]:
print(pd1)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [8]:
l = [1,2,3,4,5,6,7,8,9,10]

In [10]:
s = pd.Series(l)

In [11]:
print(s)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [16]:
df =pd.DataFrame({'name':['Alice','Bob','Claire'], 'age':[25,30,27],'gender':['Female','Male','Female']})

In [17]:
print(df)

     name  age  gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [18]:
df

     name  age  gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas series? Explain with an example.

DataFrame is two dimensional like tabular data where each column can contain different data type, whereas Series is one dimansional array like object, either single row or single column.

In [23]:
#eg:-
print(pd1) # pandas Series
df      # Pandas DataFrame

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

     name  age  gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [24]:
#Selecting a column, df['column name']
df['age']

0    25
1    30
2    27
Name: age, dtype: int64

In [25]:
#Feltering data
df[df['age']>25]

     name  age  gender
1     Bob   30    Male
2  Claire   27  Female

In [26]:
# Sorting data
df.sort_values('age')

     name  age  gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

#Series is a one-dimensional labeled array of data. It is mutable in terms of its values, but not its size. This means that you can change the values of the elements in a Series, but you cannot add or remove elements from it.

#DataFrame is a two-dimensional labeled array of data. It is mutable in terms of both its values and its size. This means that you can change the values of the elements in a DataFrame, and you can also add or remove rows and columns from it.

#Panel is a three-dimensional labeled array of data. It is mutable in terms of both its values and its size. This means that you can change the values of the elements in a Panel, and you can also add or remove rows, columns, and layers from it.

In [28]:
name = pd.Series(['Alice','Bob', 'Claire'])
age = pd.Series([25, 30, 27])
gender = pd.Series(['Female','Male','Female'])

In [29]:
pd.DataFrame({'Name':name,'Age':age,'Gender':gender})

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female